import 'game.dart';

const gameList = [
  Game(
    title: 'Warhammer 40,000: Rogue Trader',
    description:
        'Главный герой — Вольный Торговец, наследник династии фон Валанциус. В начале игры герой — лишь один из потенциальных наследников, но после загадочной смерти Теодоры, главы рода, и атаки еретиков Хаоса на её корабль события развиваются так, что именно игрок становится новым Вольным Торговцем и Лордом-Капитаном мощного звездолёта. ',
    genre: 'Компьютерная ролевая игра',
    year: 2023,
    imagePath: 'assets/images/game1.jpg',
  ),
  Game(
    title: 'Warhammer 40,000: Boltgun',
    description:
        'Действие игры разворачивается на мире-кузнице Грайя спустя несколько лет после событий Warhammer 40,000: Space Marine. Главный герой — Малум Каэдо, ветеран арьергарда Адептус Астартес из Ордена Ультрамаринов. Он направлен Инквизицией на Грайю для выполнения важной миссии. ',
    genre: 'Шутер от первого лица',
    year: 2023,
    imagePath: 'assets/images/game2.jpg',
  ),
  Game(
    title: 'Total War: Warhammer III ',
    description:
        'Действие происходит во вселенной Warhammer Fantasy. Бог-Медведь Урсун — главное божество царства Кислев — захвачен первым демон-принцем Хаоса Бе’лакором. Из-за этого северное государство погрузилось в нескончаемую зиму. У каждой фракции есть свои мотивы отправиться на поиски Урсуна.',
    genre: 'пошаговая стратегия',
    year: 2022,
    imagePath: 'assets/images/game3.jpg',
  ),
];
